Revit 2026 API

# DimensionSegment Methods

---

The DimensionSegment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsTextPositionAdjustable | Indicates if this dimension is supported to set/get TextPosition/LeaderPosition. |
|  | ResetTextPosition | Resets the text position of the segment to the initial position determined by its type and parameters. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DimensionSegment Class

Autodesk.Revit.DB Namespace